/**
* 题库数据
**/
const MockData = {

	// 植物列表数据
	'/plant/list': {
		"code": 0, 
		"data": [
			{"id": 1, "plant_id": 11001, "name": "悬铃木（法国梧桐）", "type": 1, sub_type: 1, "img": "img/11001/1.jpg", "intro": "<p>悬铃木为悬铃木科、悬铃木属植物,别名法国梧桐,简称法桐。<br>悬铃木原产欧洲,现广植于世界各地。悬铃木喜光,不耐阴,适生于酸性或中性土壤"}, 
			{"id": 2, "plant_id": 11002, "name": "垂柳", "type": 1, sub_type: 1, "img": "img/11002/1.jpg", "intro": "垂柳属杨柳科柳属,别名垂枝柳、垂丝柳、倒柳。<br>垂柳耐水性很强,被水淹160天,保存率仍达80%以上。抗寒性强,较耐盐碱,喜光不耐阴,初期生长快,寿命较短,易于养殖、更新。"}, 
			{"id": 3, "plant_id": 11003, "name": "银杏", "type": 1, sub_type: 1, "img": "img/11003/1.jpg", "intro": "银杏为银杏科,银杏属,是我国特有的孑遗植物,被称为\"活化石\",别名白果、公孙树。"}, 
			{"id": 4, "plant_id": 11004, "name": "毛白杨", "type": 1, sub_type: 1, "img": "img/11004/1.jpg", "intro": "毛白杨为杨柳科、杨属。<br>毛白杨喜光及温凉湿润气候,较耐寒、耐旱,应用范围广,在最低温度-32.8℃、年降水量300毫米～1300毫米、海拔1500米以下的山谷、平原地区均能应用于绿化。"}, 
			{"id": 5, "plant_id": 11005, "name": "南洋杉", "type": 1, sub_type: 1, "img": "img/11005/1.jpg", "intro": "最适于冬、夏温暖湿润的亚热带气候环境中生长。较耐荫，不耐干燥、寒冷，抗风力强，生长迅速，易于萌蘗(niè)。"}, 			
			{"id": 6, "plant_id": 11001, "name": "悬铃木（法国梧桐）", "type": 1, sub_type: 1, "img": "img/11001/1.jpg", "intro": "<p>悬铃木为悬铃木科、悬铃木属植物,别名法国梧桐,简称法桐。<br>悬铃木原产欧洲,现广植于世界各地。悬铃木喜光,不耐阴,适生于酸性或中性土壤"},
			{"id": 7, "plant_id": 11002, "name": "垂柳", "type": 1, sub_type: 1, "img": "img/11002/1.jpg", "intro": "垂柳属杨柳科柳属,别名垂枝柳、垂丝柳、倒柳。<br>垂柳耐水性很强,被水淹160天,保存率仍达80%以上。抗寒性强,较耐盐碱,喜光不耐阴,初期生长快,寿命较短,易于养殖、更新。"}, 
			{"id": 8, "plant_id": 11003, "name": "银杏", "type": 1, sub_type: 1, "img": "img/11003/1.jpg", "intro": "银杏为银杏科,银杏属,是我国特有的孑遗植物,被称为\"活化石\",别名白果、公孙树。"}, 
			{"id": 9, "plant_id": 11004, "name": "毛白杨", "type": 1, sub_type: 1, "img": "img/11004/1.jpg", "intro": "毛白杨为杨柳科、杨属。<br>毛白杨喜光及温凉湿润气候,较耐寒、耐旱,应用范围广,在最低温度-32.8℃、年降水量300毫米～1300毫米、海拔1500米以下的山谷、平原地区均能应用于绿化。"}, 
			{"id": 10, "plant_id": 11005, "name": "南洋杉", "type": 1, sub_type: 1, "img": "img/11005/1.jpg", "intro": "最适于冬、夏温暖湿润的亚热带气候环境中生长。较耐荫，不耐干燥、寒冷，抗风力强，生长迅速，易于萌蘗(niè)。"}, 			
		], 
		"msg": "SUCCESS"
	},
	// 植物详情数据
	'/plant/detail': {
		"code": 0, 
		"data": {
			"id": 1, 
			"plant_id": 11001, 
			"name": "悬铃木（法国梧桐）", 
			"type": 1, 
			"sub_type": 1, 
			"img": "img/11001/1.jpg", 
			"img_count": 10,
			"intro": '<p>悬铃木为悬铃木科、悬铃木属植物,别名法国梧桐,简称法桐。<br>悬铃木原产欧洲,现广植于世界各地。悬铃木喜光,不耐阴,适生于酸性或中性土壤,虽能在微碱性或石灰性土壤生长,但有些地区易发生黄叶病。较耐寒,不耐积水,北京、太原以南地区均可用于绿化。<br>虽有一定空气污染,但冬春季很少落果飞毛,球果大都夏季随雨水下落,污染较轻。现已选育并开始培育少球速生法桐苗木,能基本解决这一污染问题。<br>悬铃木叶大荫浓,树冠广展,萌芽能力强,耐修剪,抗烟尘,很少有病虫害,是优良的行道树种,曾被誉为"世界行道树之王",也是良好的庭荫和厂矿绿化树种,并且还是目前适生地区城镇道路绿化应用数量最大的树种之一。在近几年内,随着中、小城镇发展及绿化的需要,应用前景依然非常乐观。<br>喜光。喜湿润温暖气候，较耐寒。适生于微酸性或中性、排水良好的土壤，微碱性土壤虽能生长，但易发生黄化。根系分布较浅，台风时易受害而倒斜。抗空气污染能力较强，叶片具吸收有毒气体和滞积灰尘的作用。生长迅速，易成活，耐修剪；对二氧化琉、氯气等有毒气体有较强的抗性。</p>'
		},
		"msg": "SUCCESS"
	}
}

export default MockData;
